# EXPLORATORY DATA ANALYSIS WITH PANDAS

1. Convert a NumPy array that goes from 10 to 50 into a one-dimensional labelled array (i.e., Pandas Series).

In [6]:
import pandas as pd
import numpy as np

numpy = np.arange(10, 51) 
panda = pd.array(numpy)

2. Print elements with indices 1 through 3 from the above one-dimensional labelled array.

In [7]:
print(panda[:3])

<IntegerArray>
[10, 11, 12]
Length: 3, dtype: Int32

3.  Create a  a one-dimensional labelled array from a dictionary where keys become the index labels.

In [8]:
dic = {'value1': 10, 'value2': 20, 'value3': 30}
pd.Series(dic)

value1    10
value2    20
value3    30
dtype: int64

4.  Create a DataFrame with a single column from a list.

In [9]:
lst = [10, 20, 30, 40, 50]
pd.DataFrame(lst)

    0
0  10
1  20
2  30
3  40
4  50

5.  Create a DataFrame from a dictionary containing three pandas serieses having: 
- Four rows with row indices being 'a', 'b', 'c', 'd'.
- Three columns with column indices being 'one', 'two', 'three'.
- One value NaN due to dimension mismatch.

In [10]:
ps1 = pd.Series({'a': 1, 'b': 2, 'c': 3, 'd': 4})
ps2 = pd.Series({'a': 1, 'b': 2, 'c': 3, 'd': 4})
ps3 = pd.Series({'a': 1, 'b': 2, 'd': 3})
# 
# 
df = pd.DataFrame({'one': ps1, 'two': ps2, 'three': ps3})
df

   one  two  three
a    1    1    1.0
b    2    2    2.0
c    3    3    NaN
d    4    4    3.0

6.  Add a new column named ‘four’ to the above DataFrame with the last value being NaN.

In [11]:
df['four'] = {'a': 1, 'b': 2, 'c': 3}
df

   one  two  three  four
a    1    1    1.0   1.0
b    2    2    2.0   2.0
c    3    3    NaN   3.0
d    4    4    3.0   NaN

7. Delete the ‘one’ column from the above DataFrame and print the modified DataFrame.

In [12]:
df.drop(columns=['one'], axis=1, inplace=True)
print(df)

   two  three  four
a    1    1.0   1.0
b    2    2.0   2.0
c    3    NaN   3.0
d    4    3.0   NaN

8. Pop (remove and return) the ‘two’ column from the DataFrame, print the 
- popped column, and 
- modified DataFrame.

In [13]:
print(df.pop('two'))
print(df)

a    1
b    2
c    3
d    4
Name: two, dtype: int64
   three  four
a    1.0   1.0
b    2.0   2.0
c    NaN   3.0
d    3.0   NaN

9. Print the row with the index label ‘c’ from the above DataFrame. Hint: search for lac and iloc

In [14]:
print(df.loc['c'])

three    NaN
four     3.0
Name: c, dtype: float64

10. Print the row at index 2 (the third row) from the DataFrame. Hint: search for lac and iloc

In [15]:
print(df.iloc[2])

three    NaN
four     3.0
Name: c, dtype: float64

11. Create a new row DataFrame, and concatenate it with the avobe DataFrame.

In [16]:
df.loc['e'] = df.iloc[2]
print(df)

   three  four
a    1.0   1.0
b    2.0   2.0
c    NaN   3.0
d    3.0   NaN
e    NaN   3.0

12. Load the sales managers data set, then: 
- Print the sum and avg of the number of units sold.
- Print the names of the sales managers (without redundancy).
- Print the first and the third records in the data set. 
- Add a new record to the data set and print the last five records including the new record.
- Delete the record that has the index 26. 
- Save the data set to a CSV file with a new index column, then open it in Excel and notice the added and deleted records.

In [17]:
df = pd.read_csv('./SalesManager.csv')

print(df['Units'].sum())
print(df['Units'].mean())
print(df['Sales Manager'].unique())
print(df.loc[1], df.loc[3])
df.loc[len(df)] = {'OrderDate': '12-Jul-23', 'Region' : 'South', 'Sales Manager': 'Markus', 'Item': 'Coffee', 'Units' : 10, 'Price' : 5}
print(df.tail(5))
df.drop(index=26, axis=1, inplace=True)
df.to_csv('SalesManager.csv', index=True)

2095
48.72093023255814
['Mike' 'Sophie ' 'Tom ' 'Anne ' 'Jack ' 'Mike ' 'Header ' 'Bob ' 'Maria '
 'Header' 'Rob' 'Diana ' 'Alex' 'Jack' 'Markus']
Unnamed: 0               1
OrderDate        12-Jul-18
Region                East
Sales Manager      Sophie
Item                Binder
Units                   29
Price                 1.99
Name: 1, dtype: object Unnamed: 0               3
OrderDate        29-Jul-18
Region                East
Sales Manager        Anne
Item                Binder
Units                   81
Price                19.99
Name: 3, dtype: object
    Unnamed: 0  OrderDate   Region Sales Manager    Item  Units   Price
39        40.0  08-Jun-19     East         Mike   Binder     60    8.99
40        41.0  17-Jun-19  Central          Jack    Desk      5  125.00
41        42.0  25-Jun-19  Central          Tom   Pencil     90    4.99
42        43.0  12-Jul-23    South        Markus  Coffee     10    5.00
43         NaN  12-Jul-23    South        Markus  Coffee     10    5.00

13. Load the Titanic data set, then: 
- Print **only** the the top two **male** passengers with maximum **Age** and **Fare**.

In [18]:
df = pd.read_csv('./Titanic.csv')

males = df[df['Sex'] == 'male']
print(males.sort_values(['Age', 'Fare'], ascending=False)[:2])

     PassengerId  Survived  Pclass                                  Name  \
630          631         1       1  Barkworth, Mr. Algernon Henry Wilson
851          852         0       3                   Svensson, Mr. Johan

      Sex   Age  SibSp  Parch  Ticket    Fare Cabin Embarked
630  male  80.0      0      0   27042  30.000   A23        S
851  male  74.0      0      0  347060   7.775   NaN        S